In [1]:
import jason

ModuleNotFoundError: No module named 'jason'

In [2]:
import json

In [2]:
import numpy as np
import pandas as pd
from pandas import DataFrame,Series

In [3]:
dframe1 = DataFrame({'Key':['X','Z','Y','Z','X','X'],'data_set_1':np.arange(6)})

In [4]:
dframe1

  Key  data_set_1
0   X           0
1   Z           1
2   Y           2
3   Z           3
4   X           4
5   X           5

In [5]:
dframe2 = DataFrame({'Key':['Q','Y','Z'],'data_set_2':[1,2,3]})

In [6]:
dframe2

  Key  data_set_2
0   Q           1
1   Y           2
2   Z           3

In [7]:
l=pd.merge(dframe1,dframe2)
print(l)

  Key  data_set_1  data_set_2
0   Z           1           3
1   Z           3           3
2   Y           2           2

In [8]:
l.data_set_1

0    1
1    3
2    2
Name: data_set_1, dtype: int32

In [9]:
l.Key[0]

'Z'

In [10]:
# this is like left outer join in sql
pd.merge(dframe1,dframe2,on='Key',how='left')

  Key  data_set_1  data_set_2
0   X           0         NaN
1   Z           1         3.0
2   Y           2         2.0
3   Z           3         3.0
4   X           4         NaN
5   X           5         NaN

In [11]:
# this is like right outer join in sql
pd.merge(dframe1,dframe2,on='Key',how='right')

  Key  data_set_1  data_set_2
0   Q         NaN           1
1   Y         2.0           2
2   Z         1.0           3
3   Z         3.0           3

In [12]:
pd.merge(dframe1,dframe2,on='Key',how='whole')

KeyError: 'whole'

In [ ]:
# this is like full outer join in sql
pd.merge(dframe1,dframe2,on='Key',how='outer')

In [17]:
dframe3 = DataFrame({'Key':['X','X','X','Y','Z','Z'],'data_set_3':range(6)})

In [18]:
dframe3

  Key  data_set_3
0   X           0
1   X           1
2   X           2
3   Y           3
4   Z           4
5   Z           5

In [15]:
dframe4 = DataFrame({'Key':['Y','Y','X','X','Z'],'data_set_4':range(5)})

In [16]:
dframe4

  Key  data_set_4
0   Y           0
1   Y           1
2   X           2
3   X           3
4   Z           4

In [20]:
pd.merge(dframe3,dframe4)

  Key  data_set_3  data_set_4
0   X           0           2
1   X           0           3
2   X           1           2
3   X           1           3
4   X           2           2
5   X           2           3
6   Y           3           0
7   Y           3           1
8   Z           4           4
9   Z           5           4

In [19]:
pd.merge(dframe4,dframe3)

  Key  data_set_4  data_set_3
0   Y           0           3
1   Y           1           3
2   X           2           0
3   X           2           1
4   X           2           2
5   X           3           0
6   X           3           1
7   X           3           2
8   Z           4           4
9   Z           4           5

In [21]:
d_left = DataFrame({'key1':['SF','SF','LA'],
                     'key2':['one','two','three'],
                      'left_data':[10,20,30]})

In [22]:
d_right = DataFrame({'key1':['SF','SF','LA','LA'],
                     'key2':['one','one','one','two'],
                      'left_data':[40,50,60,70]})

In [23]:
d_left

  key1   key2  left_data
0   SF    one         10
1   SF    two         20
2   LA  three         30

In [24]:
d_right

  key1 key2  left_data
0   SF  one         40
1   SF  one         50
2   LA  one         60
3   LA  two         70

In [25]:
pd.merge(d_left,d_right,on=['key1','key2'],how='outer')

  key1   key2  left_data_x  left_data_y
0   SF    one         10.0         40.0
1   SF    one         10.0         50.0
2   SF    two         20.0          NaN
3   LA  three         30.0          NaN
4   LA    one          NaN         60.0
5   LA    two          NaN         70.0

In [30]:
pd.merge(d_left,d_right,on='key1',how='left')

  key1 key2_x  left_data_x key2_y  left_data_y
0   SF    one           10    one           40
1   SF    one           10    one           50
2   SF    two           20    one           40
3   SF    two           20    one           50
4   LA  three           30    one           60
5   LA  three           30    two           70